# 3.	По введенным пользователем координатам двух точек вывести
# уравнение прямой вида y = kx + b, проходящей через эти точки.

print('Координаты точки A(x1, y1):')
x1 = float(input('Введите коодинату x1 = '))
y1 = float(input('Введите координату y1 = '))

print('Координаты точки B(x2, y2):')
x2 = float(input('Введите координату x2 = '))
y2 = float(input('Введите координату y2 = '))

print('Уравнение прямой, проходящей через эти точки: ')
if x1 == x2:
    print(f'x = {x1}')
else:
    k = (y1 - y2) / (x1 - x2)
    b = y2 - k * x2
    if b < 0:
        print(f'y = {k} * x {b}')
    elif b == 0:
        print(f'y = {k} * x')
    else:
        print(f'y = {k} * x + {b}')
